doc/software_manual.org
*** ~format_matrix_into~
+ Author: Elizabeth Hunt
+ Name: ~format_matrix_into~
+ Location: ~src/matrix.c~
+ Input: a pointer to a ~Matrix_double~ and a pointer to a c-string ~s~ to "print" the vector out
  into
+ Output: nothing.
+ Side effect: overwritten memory into ~s~

#+BEGIN_SRC c
void format_matrix_into(Matrix_double *m, char *s) {
  if (m->rows == 0)
    strcpy(s, "empty");

  for (size_t y = 0; y < m->rows; ++y) {
    char row_s[256];
    strcpy(row_s, "");

    format_vector_into(m->data[y], row_s);
    strcat(s, row_s);
  }
  strcat(s, "\n");
}
#+END_SRC
** Root Finding Methods
*** ~find_ivt_range~
+ Author: Elizabeth Hunt
+ Name: ~find_ivt_range~
+ Location: ~src/roots.c~
+ Input: a pointer to a oneary function taking a double and producing a double, the beginning point
  in $R$ to search for a range, a ~delta~ step that is taken, and a ~max_steps~ number of maximum
  iterations to perform.
+ Output: a pair of ~double~'s in an ~Array_double~ representing a closed closed interval ~[beginning, end]~

#+BEGIN_SRC c
// f is well defined at start_x + delta*n for all n on the integer range [0,
// max_iterations]
Array_double *find_ivt_range(double (*f)(double), double start_x, double delta,
                             size_t max_iterations) {
  double a = start_x;

  while (f(a) * f(a + delta) >= 0 && max_iterations > 0) {
    max_iterations--;
    a += delta;
  }

  double end = a + delta;
  double begin = a - delta;

  if (max_iterations == 0 && f(begin) * f(end) >= 0)
    return NULL;
  return InitArray(double, {begin, end});
}
#+END_SRC
*** ~bisect_find_root~
+ Author: Elizabeth Hunt
+ Name(s): ~bisect_find_root~
+ Input: a one-ary function taking a double and producing a double, a closed interval represented
  by ~a~ and ~b~: ~[a, b]~, a ~tolerance~ at which we return the estimated root once $b-a < \text{tolerance}$, and a
  ~max_iterations~ to break us out of a loop if we can never reach the ~tolerance~.
+ Output: a vector of size of 3, ~double~'s representing first the range ~[a,b]~ and then the midpoint,
  ~c~ of the range.
+ Description: recursively uses binary search to split the interval until we reach ~tolerance~. We
  also assume the function ~f~ is continuous on ~[a, b]~.

#+BEGIN_SRC c
// f is continuous on [a, b]
Array_double *bisect_find_root(double (*f)(double), double a, double b,
                               double tolerance, size_t max_iterations) {
  assert(a <= b);
  // guarantee there's a root somewhere between a and b by IVT
  assert(f(a) * f(b) < 0);

  double c = (1.0 / 2) * (a + b);
  if (b - a < tolerance || max_iterations == 0)
    return InitArray(double, {a, b, c});

  if (f(a) * f(c) < 0)
    return bisect_find_root(f, a, c, tolerance, max_iterations - 1);
  return bisect_find_root(f, c, b, tolerance, max_iterations - 1);
}
#+END_SRC
*** ~bisect_find_root_with_error_assumption~
+ Author: Elizabeth Hunt
+ Name: ~bisect_find_root_with_error_assumption~
+ Input: a one-ary function taking a double and producing a double, a closed interval represented
  by ~a~ and ~b~: ~[a, b]~, and a ~tolerance~ equivalent to the above definition in ~bisect_find_root~
+ Output: a ~double~ representing the estimated root
+ Description: using the bisection method we know that $e_k \le (\frac{1}{2})^k (b_0 - a_0)$. So we can
  calculate $k$ at the worst possible case (that the error is exactly the tolerance) to be
  $\frac{log(tolerance) - log(b_0 - a_0)}{log(\frac{1}{2})}$. We pass this value into the ~max_iterations~
  of ~bisect_find_root~ as above.
#+BEGIN_SRC c
double bisect_find_root_with_error_assumption(double (*f)(double), double a,
                                              double b, double tolerance) {
  assert(a <= b);

  uint64_t max_iterations =
      (uint64_t)ceil((log(tolerance) - log(b - a)) / log(1 / 2.0));

  Array_double *a_b_root = bisect_find_root(f, a, b, tolerance, max_iterations);
  double root = a_b_root->data[2];
  free_vector(a_b_root);

  return root;
}
#+END_SRC

*** ~fixed_point_iteration_method~
+ Author: Elizabeth Hunt
+ Name: ~fixed_point_iteration_method~
+ Location: ~src/roots.c~
+ Input: a pointer to a oneary function $f$ taking a double and producing a double of which we are
  trying to find a root, a guess $x_0$, and a function $g$ of the same signature of $f$ at which we
  "step" our guesses according to the fixed point iteration method: $x_k = g(x_{k-1})$. Additionally, a
  ~max_iterations~ representing the maximum number of "steps" to take before arriving at our
  approximation and a ~tolerance~ to return our root if it becomes within [0 - tolerance, 0 + tolerance].
+ Assumptions: $g(x)$ must be a function such that at the point $x^*$ (the found root) the derivative
  $|g'(x^*)| \lt 1$
+ Output: a double representing the found approximate root $\approx x^*$.

#+BEGIN_SRC c
double fixed_point_iteration_method(double (*f)(double), double (*g)(double),
                                    double x_0, double tolerance,
                                    size_t max_iterations) {
  if (max_iterations <= 0)
    return x_0;

  double root = g(x_0);
  if (tolerance >= fabs(f(root)))
    return root;

  return fixed_point_iteration_method(f, g, root, tolerance,
                                      max_iterations - 1);
}
#+END_SRC

*** ~fixed_point_newton_method~
+ Author: Elizabeth Hunt
+ Name: ~fixed_point_newton_method~
+ Location: ~src/roots.c~
+ Input: a pointer to a oneary function $f$ taking a double and producing a double of which we are
  trying to find a root and another pointer to a function fprime of the same signature, a guess $x_0$,
  and a ~max_iterations~ and ~tolerance~ as defined in the above method are required inputs.
+ Description: continually computes elements in the sequence $x_n = x_{n-1} - \frac{f(x_{n-1})}{f'p(x_{n-1})}$
+ Output: a double representing the found approximate root $\approx x^*$ recursively applied to the sequence
  given
#+BEGIN_SRC c
double fixed_point_newton_method(double (*f)(double), double (*fprime)(double),
                                 double x_0, double tolerance,
                                 size_t max_iterations) {
  if (max_iterations <= 0)
    return x_0;

  double root = x_0 - f(x_0) / fprime(x_0);
  if (tolerance >= fabs(f(root)))
    return root;

  return fixed_point_newton_method(f, fprime, root, tolerance,
                                   max_iterations - 1);
}
#+END_SRC

